Added improvements in terms of the reports that are generated
